import "./about.css"

export function About() {
  
  return(
    <div id="about" className="anchor">
      <h2>About <small>自己紹介</small></h2>
      <span className="blueLine"></span>
      <p>こんにちは&#65281;takdesuuuuunです。</p>
      <p>私は高校生で、趣味はゲームや散歩です。ゲームは主にシューティングゲームと1人で遊ぶゲームが好きで、シューティングゲームに関しては「最上位の実力」と言えるくらいまでやりこんでいるゲームがあります&#65281;</p>
      <p>将来の夢(目標)は、日本全国を旅する、世界の色々な所を訪問するなど、旅行をたくさんできるようになりたいです&#65281;</p>
      <br />
      <p>Web関連のことに興味を持ったきっかけは、元々ゲームが好きで「プログラミングによってゲームが作られている」と知ったことです。</p>
      <p>当時は小学2年生くらいで、Scratchを結構やっていました。その時は見たことのあるゲームを再現してみたり、人気なゲームのプログラムを見たりしていて、</p>
      <p>そこから小学4年生くらいの時に「実際にコードを書いてみたい」と思い、少しだけコードエディタでHTML, CSS, JavaScriptを書いてました。</p>
      <p>その時は少し触っただけでやめてしまいましたが、高校生になって、再び始めてみたらすごく楽しくて、学習を進めています。</p>
      <br />
      <p>最近は競技プログラミングや数学、情報科学に興味があり、少しずつ調べています。</p>
    </div>
  );
}