import "./about.css"

export function About() {
  
  return(
    <div id="about">
      <h2>About</h2>
      <span></span>
      <p>こんにちは&#65281;takdesuuuuunです。</p>
      <p>私は高校生で、Web制作・開発の開始として、このポートフォリオを作っています。</p>
      <p>Web関連のことに興味を持ったきっかけは、元々ゲームが好きで「プログラミングによってゲームが作られている」と知ったことです。</p>
      <p>当時は小学2年生くらいで、Scratchを結構やっていました。その時は見たことのあるゲームを再現してみたり、人気なゲームのプログラムを見たりしていて、</p>
      <p>そこから小学4年生くらいの時に「実際にコードを書いてみたい」と思い、少しだけコードエディタでHTML, CSS, JavaScriptを書いてました。</p>
      <p>その時は少し触っただけでやめちゃいましたが、高校生になって、再び始めてみたらすごく楽しくて、学習を進めています。</p>
      <p>ゲームが好きなのは変わらずなので、将来はC#やC++にも挑戦しようと考えています。</p>
    </div>
  );
}